In [1]:
# Chapter 5: Getting Started with pandas

In [1]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
from pandas import Series, DataFrame

In [9]:
obj = pd.Series([4, 7, -5, 3])

In [11]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [13]:
obj.array

<NumpyExtensionArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [15]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [17]:
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])

In [19]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [21]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [23]:
obj2["a"]

-5

In [25]:
obj2["d"] = 6

In [27]:
obj2[["c", "a", "d"]]

c    3
a   -5
d    6
dtype: int64

In [29]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [31]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [33]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [35]:
"b" in obj2

True

In [37]:
"e" in obj2

False

In [41]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}

In [43]:
obj3 = pd.Series(sdata)

In [45]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [49]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [51]:
states = ["California", "Ohio", "Oregon", "Texas"]

In [53]:
obj4 = pd.Series(sdata, index=states)

In [57]:
obj4 # NaN (Not a Number)

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [59]:
# Use the terms “missing,” “NA,” or “null” interchangeably to refer to missing data.

In [61]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [63]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [67]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [69]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [71]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [73]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [75]:
obj4.name = "population"

In [77]:
obj4.index.name = "state"

In [79]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [81]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [83]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]

In [85]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [29]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [31]:
frame = pd.DataFrame(data)

In [33]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [34]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [35]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [39]:
pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [41]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])

In [43]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [45]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [47]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [49]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [51]:
# frame2[column] works for any column name, 
# but frame2.column works only when the column name is a valid Python variable name 
# and does not conflict with any of the method names in DataFrame.

In [53]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [55]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [57]:
frame2["debt"] = 16.5

In [59]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [61]:
frame2["debt"] = np.arange(6.)

In [63]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [65]:
val = pd.Series([-1.2, -1.5, -1.7], index=[2, 4, 5])

In [67]:
val

2   -1.2
4   -1.5
5   -1.7
dtype: float64

In [69]:
frame2["debt"] = val

In [71]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [73]:
frame2["eastern"] = frame2["state"] == "Ohio"

In [75]:
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6  -1.2     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9  -1.5    False
5  2003  Nevada  3.2  -1.7    False

In [77]:
# New columns cannot be created with the frame2.eastern dot attribute notation.

In [79]:
del frame2["eastern"]

In [81]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [83]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [85]:
# The column can be explicitly copied with the Series’s copy method.

In [87]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
               "Nevada": {2001: 2.4, 2002: 2.9}}

In [89]:
frame3 = pd.DataFrame(populations)

In [11]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [13]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [15]:
pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [17]:
pdata = {"Ohio": frame3["Ohio"][:-1],
         "Nevada": frame3["Nevada"][:2]}

In [19]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [21]:
frame3.index.name = "year"

In [23]:
frame3.columns.name = "state"

In [25]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [27]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [91]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, -1.2],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, -1.5],
       [2003, 'Nevada', 3.2, -1.7]], dtype=object)

In [93]:
obj = pd.Series(np.arange(3), index=["a", "b", "c"])

In [95]:
obj

a    0
b    1
c    2
dtype: int32

In [97]:
index = obj.index

In [99]:
index

Index(['a', 'b', 'c'], dtype='object')

In [101]:
index[1:]

Index(['b', 'c'], dtype='object')

In [105]:
# TypeError
# index[1] = "d"

In [107]:
labels = pd.Index(np.arange(3))

In [109]:
labels

Index([0, 1, 2], dtype='int32')

In [111]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [113]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [115]:
obj2.index is labels

True

In [117]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [119]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object')

In [121]:
"Ohio" in frame3.columns

True

In [123]:
2003 in frame3.index

False

In [125]:
frame3.index

Index([2000, 2001, 2002], dtype='int64')

In [131]:
pd.Index(["foo", "foo", "bar", "bar"]) # a pandas Index can contain duplicate labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [8]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])

In [10]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [12]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])

In [14]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [18]:
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])

In [20]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [22]:
obj3.reindex(np.arange(6), method="ffill") # forward-fills the values

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [26]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=["a", "c", "d"],
                     columns=["Ohio", "Texas", "California"])

In [28]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [30]:
# When passed only a sequence, it reindexes the rows in the result.
frame2 = frame.reindex(index=["a", "b", "c", "d"])

In [32]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [34]:
# The columns can be reindexed with the columns keyword.
states = ["Texas", "Utah", "California"]

In [36]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [38]:
frame.reindex(states, axis="columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [40]:
frame.loc[["a", "d", "c"], ["California", "Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

In [42]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])

In [44]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [46]:
new_obj = obj.drop("c")

In [48]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [52]:
obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [56]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])

In [58]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [60]:
# Calling drop with a sequence of labels will drop values from the row labels (axis 0).
data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [62]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [64]:
data.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [68]:
data.drop(["two", "four"], axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [70]:
obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])

In [72]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [76]:
obj["b"]

1.0

In [78]:
obj[1]

D:\TEMP\ipykernel_14056\2469632899.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[1]

1.0

In [80]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [82]:
obj[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [84]:
obj[[1, 3]]

D:\TEMP\ipykernel_14056\2982346117.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [86]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [88]:
obj.loc[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [90]:
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])

In [92]:
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])

In [94]:
obj1

2    1
0    2
1    3
dtype: int64

In [96]:
obj2

a    1
b    2
c    3
dtype: int64

In [100]:
obj1[[0, 1, 2]]

0    2
1    3
2    1
dtype: int64

In [102]:
obj2[[0, 1, 2]]

D:\TEMP\ipykernel_14056\2599987575.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj2[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

In [106]:
# When using loc, the expression obj.loc[[0, 1, 2]] will fail when the index does not contain integers.
# obj2.loc[[0, 1]]

In [108]:
obj1.iloc[[0, 1, 2]]

2    1
0    2
1    3
dtype: int64

In [110]:
obj2.iloc[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

In [112]:
obj2.loc["b":"c"] = 5 # the endpoint is inclusive

In [114]:
obj2

a    1
b    5
c    5
dtype: int64

In [92]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])

In [94]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [96]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [98]:
data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [100]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [102]:
data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [104]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [106]:
data[data < 5] = 0

In [108]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [110]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [112]:
data.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [114]:
data.loc[["Colorado", "New York"]]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

In [116]:
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int32

In [118]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [120]:
data.iloc[[2, 1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [122]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [124]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [126]:
data.loc[:"Utah", "two"]

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [128]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [130]:
data.iloc[:, :3]

          one  two  three
Ohio        0    0      0
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [132]:
data.loc[data.three >= 2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [134]:
ser = pd.Series(np.arange(3.))

In [136]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [138]:
# Pandas does not want to guess what the user wants (label-based indexing or position-based)
# ser[-1]

In [140]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [142]:
ser2 = pd.Series(np.arange(3.), index=["a", "b", "c"])

In [144]:
ser2[-1]

D:\TEMP\ipykernel_9632\811950851.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser2[-1]

2.0

In [146]:
ser[:2]

0    0.0
1    1.0
dtype: float64

In [148]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [150]:
data.loc[:, "one"] = 1

In [152]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [154]:
data.iloc[2] = 5

In [156]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        5    5      5     5
New York    1   13     14    15

In [158]:
data.loc[data["four"] > 5] = 3

In [160]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [162]:
# The special SettingWithCopyWarning warns you that you are trying to modify a temporary value
# (the nonempty result of data.loc[data.three == 5]) instead of the original DataFrame data.
data.loc[data.three == 5]["three"] = 6

D:\TEMP\ipykernel_9632\2628965532.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data.loc[data.three == 5]["three"] = 6

In [164]:
data # data was unmodified

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [166]:
data.loc[data.three == 5]

      one  two  three  four
Utah    5    5      5     5

In [168]:
# The fix is to rewrite the chained assignment to use a single loc operation.
data.loc[data.three == 5, "three"] = 6

In [170]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      6     5
New York    3    3      3     3

In [172]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])

In [176]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index = ["a", "c", "e", "f", "g"])

In [180]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [182]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [186]:
# The internal data alignment introduces missing values in the label locations that don’t overlap. 
# Missing values will then propagate in further arithmetic computations.
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [188]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"),
                   index=["Ohio", "Texas", "Colorado"])

In [190]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
                   index=["Utah", "Ohio", "Texas", "Oregon"])

In [192]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [194]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [196]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [198]:
df1 = pd.DataFrame({"A": [1, 2]})

In [200]:
df2 = pd.DataFrame({"B": [3, 4]})

In [202]:
df1

   A
0  1
1  2

In [204]:
df2

   B
0  3
1  4

In [206]:
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

In [208]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list("abcd"))

In [210]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list("abcde"))

In [212]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [214]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [222]:
df2.loc[1, "b"] = np.nan # NaN (Not a Number)

In [218]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [220]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [224]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [226]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [228]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [232]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [234]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [236]:
arr = np.arange(12.).reshape((3, 4))

In [238]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [240]:
arr[0]

array([0., 1., 2., 3.])

In [242]:
arr - arr[0] # broadcasting

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [256]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])

In [258]:
series = frame.iloc[0]

In [260]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [262]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [264]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [268]:
series2 = pd.Series(np.arange(3), index=["b", "e", "f"])

In [270]:
series2

b    0
e    1
f    2
dtype: int32

In [272]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [274]:
series3 = frame["d"]

In [276]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [278]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [282]:
# Match on the DataFrame’s row index (axis="index") and broadcast across the columns.
frame.sub(series3, axis="index")

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [284]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])

In [286]:
frame

               b         d         e
Utah   -1.135852  0.415381  0.188967
Ohio    0.013946 -0.441588  0.364817
Texas   0.174507  0.048997  0.143391
Oregon  0.375481  1.175486 -0.301975

In [288]:
np.abs(frame) # element-wise array methods

               b         d         e
Utah    1.135852  0.415381  0.188967
Ohio    0.013946  0.441588  0.364817
Texas   0.174507  0.048997  0.143391
Oregon  0.375481  1.175486  0.301975

In [290]:
def f1(x):
    return x.max() - x.min()

In [292]:
frame.apply(f1)

b    1.511333
d    1.617074
e    0.666793
dtype: float64

In [296]:
frame.apply(f1, axis="columns") # apply across the columns

Utah      1.551233
Ohio      0.806405
Texas     0.125510
Oregon    1.477461
dtype: float64

In [298]:
def f2(x):
    return pd.Series([x.min(), x.max()], index=["min", "max"])

In [300]:
frame.apply(f2)

            b         d         e
min -1.135852 -0.441588 -0.301975
max  0.375481  1.175486  0.364817

In [302]:
def my_format(x):
    return f"{x:.2f}"

In [304]:
frame.applymap(my_format)

D:\TEMP\ipykernel_9632\1462544007.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  frame.applymap(my_format)

            b      d      e
Utah    -1.14   0.42   0.19
Ohio     0.01  -0.44   0.36
Texas    0.17   0.05   0.14
Oregon   0.38   1.18  -0.30

In [306]:
frame["e"].map(my_format)

Utah       0.19
Ohio       0.36
Texas      0.14
Oregon    -0.30
Name: e, dtype: object

In [308]:
frame.map(my_format)

            b      d      e
Utah    -1.14   0.42   0.19
Ohio     0.01  -0.44   0.36
Texas    0.17   0.05   0.14
Oregon   0.38   1.18  -0.30

In [310]:
obj = pd.Series(np.arange(4), index=["d", "a", "b", "c"])

In [312]:
obj

d    0
a    1
b    2
c    3
dtype: int32

In [314]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [316]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=["three", "one"],
                     columns=["d", "a", "b", "c"])

In [318]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [320]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [322]:
frame.sort_index(axis="columns")

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [328]:
frame.sort_index().sort_index(axis="columns")

       a  b  c  d
one    5  6  7  4
three  1  2  3  0

In [330]:
frame.sort_index(axis="columns", ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [332]:
obj = pd.Series([4, 7, -3, 2])

In [334]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [336]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [340]:
# Any missing values are sorted to the end of the Series by default.
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [342]:
obj.sort_values(na_position="first")

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [344]:
frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})

In [346]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [348]:
frame.sort_values("b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [350]:
frame.sort_values(["a", "b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [352]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [354]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [362]:
# By default, rank breaks ties by assigning each group the mean rank.
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [366]:
# Ranks can also be assigned according to the order in which they’re observed in the data.
obj.rank(method="first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [368]:
obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [370]:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1],
                      "c": [-2, 5, 8, -2.5]})

In [372]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [374]:
frame.rank(axis="columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [376]:
obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])

In [378]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [380]:
obj.index.is_unique

False

In [388]:
obj["a"] # return a Series

a    0
a    1
dtype: int32

In [390]:
obj["c"] # return a scalar value

4

In [392]:
df = pd.DataFrame(np.random.standard_normal((5, 3)),
                  index=["a", "a", "b", "b", "c"])

In [394]:
df

          0         1         2
a  1.465892 -1.242291  0.619307
a -0.585602  1.079481 -0.172835
b  0.222561  0.790924  1.695566
b  1.835334 -0.842012  0.199897
c  1.192978  1.005752 -0.493626

In [400]:
df.loc["b"] # return a DataFrame

          0         1         2
b  0.222561  0.790924  1.695566
b  1.835334 -0.842012  0.199897

In [402]:
df.loc["c"] # return a Series

0    1.192978
1    1.005752
2   -0.493626
Name: c, dtype: float64

In [7]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=["a", "b", "c", "d"],
                  columns=["one", "two"])

In [9]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [11]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [15]:
# When an entire row or column contains all NA values, the sum is 0.
df.sum(axis="columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [17]:
df.sum(axis="index", skipna=False)

one   NaN
two   NaN
dtype: float64

In [19]:
df.sum(axis="columns", skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [21]:
df.mean(axis="columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [23]:
df.idxmax()

one    b
two    d
dtype: object

In [25]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [27]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [31]:
obj = pd.Series(["a", "a", "b", "c"] * 4)

In [33]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [35]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [37]:
price = pd.read_pickle("examples/yahoo_price.pkl")

In [39]:
volume = pd.read_pickle("examples/yahoo_volume.pkl")

In [43]:
returns = price.pct_change()

In [45]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [47]:
returns["MSFT"].corr(returns["IBM"])

0.4997636114415114

In [49]:
returns["MSFT"].cov(returns["IBM"])

8.870655479703546e-05

In [51]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [53]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [55]:
returns.corrwith(returns["IBM"])

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [57]:
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

In [59]:
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])

In [65]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [61]:
uniques = obj.unique()

In [63]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [67]:
uniques.sort()

In [69]:
uniques

array(['a', 'b', 'c', 'd'], dtype=object)

In [71]:
obj.value_counts()

c    3
a    3
b    2
d    1
Name: count, dtype: int64

In [73]:
pd.value_counts(obj.to_numpy(), sort=False)

D:\TEMP\ipykernel_1708\164454357.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(obj.to_numpy(), sort=False)

c    3
a    3
d    1
b    2
Name: count, dtype: int64

In [75]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [77]:
mask = obj.isin(["b", "c"])

In [79]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [81]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [85]:
to_match = pd.Series(["c", "a", "b", "b", "c", "a"])

In [87]:
unique_vals = pd.Series(["c", "b", "a"])

In [89]:
indices = pd.Index(unique_vals).get_indexer(to_match)

In [91]:
indices

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [93]:
data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4],
                     "Qu2": [2, 3, 1, 2, 3],
                     "Qu3": [1, 5, 2, 4, 4]})

In [95]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [97]:
data["Qu1"].value_counts().sort_index()

Qu1
1    1
3    2
4    2
Name: count, dtype: int64

In [99]:
result = data.apply(pd.value_counts).fillna(0)

D:\TEMP\ipykernel_1708\2451317050.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  result = data.apply(pd.value_counts).fillna(0)

In [103]:
# The row labels in the result are the distinct values occurring in all of the columns. 
# The values are the respective counts of these values in each column.
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [105]:
data = pd.DataFrame({"a": [1, 1, 1, 2, 2], "b": [0, 0, 1, 0, 0]})

In [107]:
data

   a  b
0  1  0
1  1  0
2  1  1
3  2  0
4  2  0

In [111]:
data.value_counts() # hierarchical index

a  b
1  0    2
2  0    2
1  1    1
Name: count, dtype: int64